Revit 2027 API
RebarUpdateCurvesData.IsAttachmentTypeChanged Property
 Indicates if the attachment type has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAttachmentTypeChanged { get; }
Public ReadOnly Property IsAttachmentTypeChanged As Boolean
	Get
public:
property bool IsAttachmentTypeChanged {
	bool get ();
}
member IsAttachmentTypeChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace